Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
    esp_err_t ret = slam_core_init_camera(&camera_config);
    if (ret == ESP_OK) {
        system_status.camera_initialized = true;
        xEventGroupSetBits(system_event_group, CAMERA_READY_BIT);
        ESP_LOGI(TAG, "✅ Camera initialized successfully");
    } else {
        ESP_LOGE(TAG, "❌ Camera initialization failed: %s", esp_err_to_name(ret));
    }
    
    return ret;
}

/**
 * Initialize GPS module (uBlox)
 */
static esp_err_t initialize_gps(void)
{
    ESP_LOGI(TAG, "🛰️ Initializing uBlox GPS module...");
    
    // Initialize GPS configuration - use loaded config if available
    gps_ublox_config_t gps_config;
    if (master_config.loaded) {
        ESP_LOGI(TAG, "🛰️ Using loaded GPS configuration");
        gps_config.uart_port = master_config.gps.base_config.uart_port;
        gps_config.baud_rate = master_config.gps.base_config.baud_rate;
        gps_config.tx_pin = master_config.gps.base_config.tx_pin;
        gps_config.rx_pin = master_config.gps.base_config.rx_pin;
        gps_config.update_rate_hz = 5;  // Default 5Hz
        gps_config.enable_sbas = false;
        gps_config.enable_differential = false;
        gps_config.timeout_ms = 10000;
    } else {
        ESP_LOGI(TAG, "🛰️ Using default GPS configuration");
        // Use hardcoded defaults
        gps_config.uart_port = UART_NUM_1;
        gps_config.baud_rate = 9600;
        gps_config.tx_pin = GPS_UART_TX_PIN;
        gps_config.rx_pin = GPS_UART_RX_PIN;
        gps_config.update_rate_hz = 5;
        gps_config.enable_sbas = false;
        gps_config.enable_differential = false;
        gps_config.timeout_ms = 10000;
    }
    
    esp_err_t ret = gps_ublox_init(&gps_config);
    if (ret == ESP_OK) {
        // Test hardware connectivity by checking if GPS is responding
        vTaskDelay(pdMS_TO_TICKS(2000)); // Wait 2 seconds for GPS to initialize
        
        if (gps_ublox_is_connected()) {
            system_status.gps_connected = true;
            xEventGroupSetBits(system_event_group, GPS_READY_BIT);
            ESP_LOGI(TAG, "✅ GPS initialized successfully - hardware connected");
        } else {
            system_status.gps_connected = false;
            ESP_LOGW(TAG, "⚠️ GPS initialized but hardware not detected - no GPS data received");
            ESP_LOGI(TAG, "ℹ️ GPS will continue monitoring for hardware connection");
        }
    } else {
        ESP_LOGE(TAG, "❌ GPS initialization failed: %s", esp_err_to_name(ret));
    }

    // Initialize AssistNow Offline if enabled and token is configured
    if (master_config.gps.assistnow_enabled &&
        strlen(master_config.gps.assistnow_token) > 0) {

        assistnow_config_t assistnow_config = {
            .enabled = master_config.gps.assistnow_enabled,
            .update_interval_hours = master_config.gps.assistnow_update_interval_hours,
            .validity_hours = master_config.gps.assistnow_validity_hours,
            .auto_download = master_config.gps.assistnow_auto_download,
            .period_days = 4,           // Match u-blox software default
            .resolution_hours = 1,      // Match u-blox software default
        };

        strcpy(assistnow_config.token, master_config.gps.assistnow_token);
        strcpy(assistnow_config.server_url, master_config.gps.assistnow_server_url);
        strcpy(assistnow_config.data_file_path, "/sdcard/assistnow/assistnow.ubx");
        strcpy(assistnow_config.gnss_constellations, "gps,glo,bds,gal");  // Include BeiDou

        ret = assistnow_init(&assistnow_config);
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ AssistNow Offline initialized");

            // Set WiFi configuration for AssistNow downloads
            wifi_assistnow_config_t wifi_config = {
                .connect_timeout_ms = master_config.system.wifi_connect_timeout_ms > 0 ?
                                    master_config.system.wifi_connect_timeout_ms : 30000,
                .auto_reconnect = master_config.system.wifi_auto_reconnect
            };
            strcpy(wifi_config.ssid, master_config.system.wifi_ssid);
            strcpy(wifi_config.password, master_config.system.wifi_password);

            ret = assistnow_set_wifi_config(&wifi_config);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ WiFi configuration set for AssistNow downloads");
            } else {
                ESP_LOGW(TAG, "⚠️ Failed to set WiFi config for AssistNow: %s", esp_err_to_name(ret));
            }

            // Configure WiFi for AssistNow downloads if credentials are provided
            if (strlen(master_config.system.wifi_ssid) > 0 &&
                strlen(master_config.system.wifi_password) > 0) {

                ret = wifi_assistnow_init(&wifi_config);
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "✅ WiFi configured for AssistNow downloads");
                } else {
                    ESP_LOGW(TAG, "⚠️ WiFi configuration failed: %s", esp_err_to_name(ret));
                }
            } else {
                ESP_LOGI(TAG, "ℹ️ WiFi credentials not configured for AssistNow");
            }

            // Load existing AssistNow data to GPS if available
            if (assistnow_is_data_valid()) {
                assistnow_upload_to_gps();
            }

            // Start auto-update if enabled
            if (master_config.gps.assistnow_auto_download) {
                assistnow_start_auto_update();
            }
        } else {
            ESP_LOGW(TAG, "⚠️ AssistNow Offline initialization failed: %s", esp_err_to_name(ret));
        }
    } else {
        ESP_LOGI(TAG, "ℹ️ AssistNow Offline disabled or no token configured");
    }

    // Initialize Position Aiding if enabled
    if (master_config.gps.position_aiding_enabled) {
        ESP_LOGI(TAG, "🎯 Initializing Position Aiding...");

        if (master_config.gps.use_takeoff_position &&
            master_config.gps.takeoff_latitude != 0.0 &&
            master_config.gps.takeoff_longitude != 0.0) {

            // Use takeoff position for position aiding
            ret = gps_ublox_set_position_aiding(
                master_config.gps.takeoff_latitude,
                master_config.gps.takeoff_longitude,
                master_config.gps.takeoff_altitude_m,
                master_config.gps.position_accuracy_m,
                master_config.gps.altitude_accuracy_m
            );

            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ Position aiding set to takeoff coordinates: %.6f, %.6f, %.1fm",
                         master_config.gps.takeoff_latitude,
                         master_config.gps.takeoff_longitude,
                         master_config.gps.takeoff_altitude_m);
            } else {
                ESP_LOGW(TAG, "⚠️ Failed to set position aiding: %s", esp_err_to_name(ret));
            }
        } else {
            ESP_LOGI(TAG, "ℹ️ Position aiding enabled but no takeoff coordinates configured");
            ESP_LOGI(TAG, "💡 Configure takeoff coordinates in gps_config.json for better GPS performance");
        }
    } else {
        ESP_LOGI(TAG, "ℹ️ Position aiding disabled");
    }

    return ret;
}

/**
 * Initialize MSP Protocol for INAV communication
 */
static esp_err_t initialize_msp(void)
{
    ESP_LOGI(TAG, "� Initializing MSP Protocol for INAV...");
    
    // Initialize MSP configuration - use loaded config if available
    msp_config_t msp_config;
    if (master_config.loaded) {
        ESP_LOGI(TAG, "📡 Using loaded MSP configuration");
        msp_config.uart_port = master_config.msp.base_config.uart_port;
        msp_config.baud_rate = master_config.msp.base_config.baud_rate;
        msp_config.tx_pin = master_config.msp.base_config.tx_pin;
        msp_config.rx_pin = master_config.msp.base_config.rx_pin;
        msp_config.timeout_ms = master_config.msp.base_config.timeout_ms;
        msp_config.auto_reconnect = master_config.msp.base_config.auto_reconnect;
    } else {
        ESP_LOGI(TAG, "📡 Using default MSP configuration");
        // Use hardcoded defaults
        msp_config.uart_port = UART_NUM_2;
        msp_config.baud_rate = 115200;
        msp_config.tx_pin = MSP_UART_TX_PIN;
        msp_config.rx_pin = MSP_UART_RX_PIN;
        msp_config.timeout_ms = 5000;
        msp_config.auto_reconnect = true;
    }
    
    esp_err_t ret = msp_protocol_init(&msp_config);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ MSP Protocol initialized successfully");
        
