Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
        // Test MSP connection by requesting status
        ret = msp_request_status();
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "� MSP connection test successful");
        } else {
            ESP_LOGW(TAG, "⚠️ MSP connection test failed, but protocol initialized");
        }
    } else {
        ESP_LOGE(TAG, "❌ MSP Protocol initialization failed: %s", esp_err_to_name(ret));
    }
    
    return ret;
}

/**
 * Initialize Visual SLAM system
 */
static esp_err_t initialize_slam(void)
{
    ESP_LOGI(TAG, "🧠 Initializing Visual SLAM system...");
    
    // Log memory status before SLAM initialization
    ESP_LOGI(TAG, "Memory status before SLAM init:");
    ESP_LOGI(TAG, "  Internal RAM free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
    ESP_LOGI(TAG, "  SPIRAM free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
    ESP_LOGI(TAG, "  Total free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_8BIT));
    
    // Initialize SLAM configuration - use loaded config if available
    slam_config_t slam_config;
    if (master_config.loaded) {
        ESP_LOGI(TAG, "🧠 Using loaded SLAM configuration");
        slam_config.max_features = master_config.slam.base_config.max_features;
        slam_config.fast_threshold = master_config.slam.base_config.fast_threshold;
        slam_config.levels = master_config.slam.base_config.levels;
        slam_config.scale_factor = master_config.slam.base_config.scale_factor;
        slam_config.max_keypoints_per_level = master_config.slam.base_config.max_keypoints_per_level;
        slam_config.use_harris_detector = master_config.slam.base_config.use_harris_detector;
        slam_config.harris_k = master_config.slam.base_config.harris_k;
        slam_config.descriptor_distance_threshold = master_config.slam.base_config.descriptor_distance_threshold;
        slam_config.match_threshold = master_config.slam.base_config.match_threshold;
        slam_config.min_tracked_features = master_config.slam.base_config.min_tracked_features;
        slam_config.keyframe_distance_threshold = master_config.slam.base_config.keyframe_distance_threshold;
        slam_config.keyframe_angle_threshold = master_config.slam.base_config.keyframe_angle_threshold;
        slam_config.max_keyframes = master_config.slam.base_config.max_keyframes;
        slam_config.enable_loop_closure = master_config.slam.base_config.enable_loop_closure;
        slam_config.loop_closure_threshold = master_config.slam.base_config.loop_closure_threshold;
    } else {
        ESP_LOGI(TAG, "🧠 Using default SLAM configuration");
        // Use hardcoded defaults
        slam_config.max_features = 500;
        slam_config.fast_threshold = 20.0f;
        slam_config.levels = 8;
        slam_config.scale_factor = 1.2f;
        slam_config.max_keypoints_per_level = 100;
        slam_config.use_harris_detector = false;
        slam_config.harris_k = 0.04f;
        slam_config.descriptor_distance_threshold = 50;
        slam_config.match_threshold = 0.7f;
        slam_config.min_tracked_features = 30;
        slam_config.keyframe_distance_threshold = 1.0f;
        slam_config.keyframe_angle_threshold = 0.2f;
        slam_config.max_keyframes = 50;
        slam_config.enable_loop_closure = true;
        slam_config.loop_closure_threshold = 0.8f;
    }
    
    esp_err_t ret = slam_core_init(&slam_config);
    if (ret == ESP_OK) {
        system_status.slam_active = true;
        xEventGroupSetBits(system_event_group, SLAM_READY_BIT);
        ESP_LOGI(TAG, "✅ SLAM system initialized successfully");
        
        // Log memory status after SLAM initialization
        ESP_LOGI(TAG, "Memory status after SLAM init:");
        ESP_LOGI(TAG, "  Internal RAM free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
        ESP_LOGI(TAG, "  SPIRAM free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
        ESP_LOGI(TAG, "  Total free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_8BIT));
    } else {
        ESP_LOGE(TAG, "❌ SLAM initialization failed: %s", esp_err_to_name(ret));
    }
    
    return ret;
}

/**
 * Main processing task - handles camera frames and SLAM processing
 */
static void main_processing_task(void *pvParameters)
{
    ESP_LOGI(TAG, "🏃 Main processing task started");
    
    // Wait for all systems to be ready
    EventBits_t bits = xEventGroupWaitBits(system_event_group, ALL_SYSTEMS_READY, 
                                          pdFALSE, pdTRUE, portMAX_DELAY);
    
    if ((bits & ALL_SYSTEMS_READY) == ALL_SYSTEMS_READY) {
        ESP_LOGI(TAG, "🚀 All systems ready - starting main processing loop");
        gpio_set_level(SYSTEM_STATUS_LED_PIN, 1); // System ready LED
        
        // Start comprehensive logging session
        char session_name[64];
        time_t now = time(NULL);
        struct tm timeinfo;
        localtime_r(&now, &timeinfo);
        strftime(session_name, sizeof(session_name), "slam_mission_%Y%m%d_%H%M%S", &timeinfo);
        
        esp_err_t log_ret = sd_storage_start_comprehensive_logging(session_name);
        if (log_ret == ESP_OK) {
            ESP_LOGI(TAG, "📊 Comprehensive logging started: %s", session_name);
        } else {
            ESP_LOGW(TAG, "⚠️ Failed to start comprehensive logging: %s", esp_err_to_name(log_ret));
        }
    }
    
    TickType_t last_wake_time = xTaskGetTickCount();
    const TickType_t frequency = pdMS_TO_TICKS(33); // ~30 FPS
    uint32_t loop_counter = 0;
    
    while (1) {
        uint64_t loop_start_time = esp_timer_get_time();
        loop_counter++;
        
        // Get camera frame
        camera_frame_t frame;
        esp_err_t ret = slam_core_get_frame(&frame);
        
        if (ret == ESP_OK && frame.data != NULL) {
            system_status.frame_count++;
            
            // Toggle SLAM activity LED (only every 15 frames to reduce GPIO overhead)
            if (system_status.frame_count % 15 == 0) {
                static bool slam_led_state = false;
                slam_led_state = !slam_led_state;
                gpio_set_level(SLAM_ACTIVITY_LED_PIN, slam_led_state);
            }
            
