Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
                // Get connection info for logging
                wifi_connection_info_t conn_info;
                if (wifi_manager_get_connection_info(&conn_info) == ESP_OK) {
                    if (conn_info.is_ap_mode) {
                        ESP_LOGI(TAG, "📶 Web server starting in AP mode");
                        ESP_LOGI(TAG, "📶 AP SSID: %s", conn_info.ssid);
                        ESP_LOGI(TAG, "🌐 Access at: http://192.168.4.1:80");
                    } else {
                        ESP_LOGI(TAG, "📶 Web server starting in station mode");
                        ESP_LOGI(TAG, "📶 Connected to: %s", conn_info.ssid);
                        ESP_LOGI(TAG, "🌐 Access at: http://%s:80", conn_info.ip_addr);
                    }
                }
                break;
            } else if (wifi_status == WIFI_MGR_STATUS_ERROR) {
                ESP_LOGW(TAG, "⚠️ WiFi manager in error state, starting web server anyway");
                break;
            }

            vTaskDelay(pdMS_TO_TICKS(1000));
            wait_count++;
        }

        if (wait_count >= 30) {
            ESP_LOGW(TAG, "⚠️ WiFi manager timeout, starting web server anyway");
        }
    } else {
        ESP_LOGI(TAG, "🌐 WiFi disabled, starting web server without network connectivity");
    }

    // Start the web server
    esp_err_t ret = web_server_start();
    if (ret == ESP_OK) {
        system_status.web_server_running = true;
        xEventGroupSetBits(system_event_group, WEB_SERVER_READY_BIT);
        ESP_LOGI(TAG, "✅ Web server started on port 80");

        // Send startup notification
        web_server_send_notification("Visual SLAM system started successfully", "info");
    } else {
        ESP_LOGW(TAG, "⚠️ HTTP server failed to start: %s", esp_err_to_name(ret));
        ESP_LOGI(TAG, "📡 Web server will retry in background");
    }

    // Web server runs indefinitely
    while (1) {
        // Update uptime
        system_status.uptime_seconds = esp_timer_get_time() / 1000000;

        // Send periodic status updates if web server is running
        if (system_status.web_server_running) {
            static uint32_t telemetry_counter = 0;
            if (++telemetry_counter >= 10) { // Every 10 seconds
                telemetry_counter = 0;
                web_server_broadcast_telemetry(&system_status);
            }
        }

        // Monitor WiFi status and log changes
        if (master_config.loaded && master_config.system.wifi_enabled) {
            static wifi_manager_status_t last_wifi_status = WIFI_MGR_STATUS_DISABLED;
            wifi_manager_status_t current_wifi_status = wifi_manager_get_status();

            if (current_wifi_status != last_wifi_status) {
                switch (current_wifi_status) {
                    case WIFI_MGR_STATUS_CONNECTED:
                        ESP_LOGI(TAG, "📶 WiFi status changed: Connected to network");
                        break;
                    case WIFI_MGR_STATUS_AP_MODE:
                        ESP_LOGI(TAG, "📶 WiFi status changed: AP mode active");
                        break;
                    case WIFI_MGR_STATUS_ERROR:
                        ESP_LOGW(TAG, "📶 WiFi status changed: Connection error");
                        break;
                    default:
                        break;
                }
                last_wifi_status = current_wifi_status;
            }
        }

        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}/**
 * Telemetry broadcast task - sends real-time data to connected clients
 */
static void telemetry_broadcast_task(void *pvParameters)
{
    ESP_LOGI(TAG, "📡 Telemetry broadcast task started");
    
    // Wait for web server to be ready
    xEventGroupWaitBits(system_event_group, WEB_SERVER_READY_BIT, 
                       pdFALSE, pdTRUE, portMAX_DELAY);
    
    TickType_t last_wake_time = xTaskGetTickCount();
    const TickType_t frequency = pdMS_TO_TICKS(100); // 10 Hz telemetry
    
    while (1) {
        // Update system status and broadcast to web clients
        system_status.uptime_seconds = esp_timer_get_time() / 1000000;
        
        // Send telemetry data if web server is running
        if (system_status.web_server_running) {
            web_server_broadcast_telemetry(&system_status);
        }
        
        vTaskDelayUntil(&last_wake_time, frequency);
    }
}

/**
 * Sensor monitoring task - monitors GPS/IMU/MSP connections and attempts reconnection
 */
static void sensor_monitoring_task(void *pvParameters)
{
    ESP_LOGI(TAG, "🔍 Sensor monitoring task started");
    
    // Initial delay to let system stabilize
    vTaskDelay(pdMS_TO_TICKS(10000)); // Wait 10 seconds after boot
    
    TickType_t last_gps_check = 0;
    TickType_t last_imu_check = 0;
    TickType_t last_msp_check = 0;
    TickType_t last_wifi_check = 0;
    
    while (1) {
        TickType_t current_time = xTaskGetTickCount();
        
        // Check GPS connection every 30 seconds
        if ((current_time - last_gps_check) >= pdMS_TO_TICKS(30000)) {
            last_gps_check = current_time;
            
            // Check GPS hardware connectivity by attempting to read data
            bool gps_hardware_connected = false;
            
            // Try to read from GPS UART to check if hardware is responding
            uart_config_t uart_config = {
                .baud_rate = master_config.loaded ? master_config.gps.base_config.baud_rate : 9600,
                .data_bits = UART_DATA_8_BITS,
                .parity = UART_PARITY_DISABLE,
                .stop_bits = UART_STOP_BITS_1,
                .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
                .source_clk = UART_SCLK_DEFAULT,
            };
            
            uart_port_t gps_port = master_config.loaded ? master_config.gps.base_config.uart_port : UART_NUM_1;
            
            // Configure UART for GPS
            if (uart_param_config(gps_port, &uart_config) == ESP_OK) {
                if (uart_set_pin(gps_port, 
                    master_config.loaded ? master_config.gps.base_config.tx_pin : GPS_UART_TX_PIN,
                    master_config.loaded ? master_config.gps.base_config.rx_pin : GPS_UART_RX_PIN,
                    UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE) == ESP_OK) {
                    
                    if (uart_driver_install(gps_port, 256, 0, 0, NULL, 0) == ESP_OK) {
                        // Try to read some data to check if GPS is actually connected
                        uint8_t gps_buffer[64];
                        int len = uart_read_bytes(gps_port, gps_buffer, sizeof(gps_buffer), pdMS_TO_TICKS(100));
                        
                        if (len > 0) {
                            // Check if we received valid NMEA data (starts with $)
                            for (int i = 0; i < len; i++) {
                                if (gps_buffer[i] == '$') {
                                    gps_hardware_connected = true;
                                    break;
                                }
                            }
                        }
                        
                        uart_driver_delete(gps_port);
                    }
                }
            }
            
            if (!gps_hardware_connected) {
                ESP_LOGW(TAG, "🛰️ GPS hardware not detected - no valid data received");
                system_status.gps_connected = false;
                xEventGroupClearBits(system_event_group, GPS_READY_BIT);
                
                // Mark GPS as unavailable in sensor fusion
                sensor_status_t sensor_status;
                if (sensor_fusion_get_sensor_status(&sensor_status) == ESP_OK) {
                    sensor_status.gps_available = false;
                    // Note: We can't directly set this back, but we can reinitialize sensor fusion
                }
            } else {
                ESP_LOGD(TAG, "🛰️ GPS hardware detected - receiving valid data");
                system_status.gps_connected = true;
                xEventGroupSetBits(system_event_group, GPS_READY_BIT);
            }
        }
        
        // Check IMU connection every 15 seconds
        if ((current_time - last_imu_check) >= pdMS_TO_TICKS(15000)) {
            last_imu_check = current_time;
            
            // Check IMU hardware connectivity by attempting to read sensor data
            bool imu_hardware_connected = false;
            
            // Try to read IMU data to check if hardware is responding
            imu_data_t imu_data;
            if (imu_get_data(&imu_data) == ESP_OK) {
                // Check if the data looks reasonable (not all zeros or invalid values)
                if (imu_data.accel_x != 0.0f || imu_data.accel_y != 0.0f || imu_data.accel_z != 0.0f ||
                    imu_data.gyro_x != 0.0f || imu_data.gyro_y != 0.0f || imu_data.gyro_z != 0.0f) {
                    imu_hardware_connected = true;
                }
            }
            
            if (!imu_hardware_connected) {
                ESP_LOGW(TAG, "🔄 IMU hardware not detected - no valid sensor data");
                system_status.imu_connected = false;
                
                // Mark IMU as unavailable in sensor fusion
                sensor_status_t sensor_status;
                if (sensor_fusion_get_sensor_status(&sensor_status) == ESP_OK) {
                    sensor_status.imu_available = false;
                    // Note: We can't directly set this back, but we can reinitialize sensor fusion
                }
            } else {
                ESP_LOGD(TAG, "🔄 IMU hardware detected - receiving valid sensor data");
                system_status.imu_connected = true;
            }
        }
        
        // Check MSP connection every 20 seconds
        if ((current_time - last_msp_check) >= pdMS_TO_TICKS(20000)) {
            last_msp_check = current_time;
            
            // Check MSP connection using the built-in connection check
            if (!msp_is_connected()) {
                ESP_LOGW(TAG, "📡 MSP flight controller not detected - no recent messages");
                system_status.msp_connected = false;
            } else {
                ESP_LOGD(TAG, "📡 MSP flight controller connected - receiving messages");
                system_status.msp_connected = true;
            }
        }
        
        // Check WiFi and communication status every 10 seconds
        if ((current_time - last_wifi_check) >= pdMS_TO_TICKS(10000)) {
            last_wifi_check = current_time;
            
