Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
            // Print comprehensive WiFi status from the WiFi manager
            wifi_manager_print_comprehensive_status();
            
            // Print basic communication status and send heartbeat to C6
            ESP_LOGI(TAG, "📡 Communication with C6: Sending heartbeat and status update");
            esp_err_t comm_ret = comm_send_heartbeat_auto();
            if (comm_ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ Communication with C6 successful");
            } else {
                ESP_LOGW(TAG, "⚠️ Communication with C6 failed: %s", esp_err_to_name(comm_ret));
            }
        }
        
        // Update system status with current sensor states
        // Note: GPS and IMU status are updated in their respective check sections above
        // MSP status is updated in its check section above
        
        vTaskDelay(pdMS_TO_TICKS(5000)); // Check every 5 seconds
    }
}

/**
 * WIFI toggle button interrupt service routine
 */
/*
static void IRAM_ATTR wifi_toggle_button_isr(void* arg)
{
    // Create a task to handle WIFI toggle to avoid ISR complexity
    xTaskCreate(wifi_toggle_task, "wifi_toggle", 2048, NULL, 5, NULL);
}
*/

/**
 * WIFI toggle task - handles WIFI on/off logic
 */
/*
void wifi_toggle_task(void* arg)
{
    // Debounce delay
    vTaskDelay(pdMS_TO_TICKS(50));

    // Check if button is still pressed (debounce)
    if (gpio_get_level(WIFI_TOGGLE_BUTTON_PIN) == 0) {
        // Toggle WIFI state
        if (wifi_enabled) {
            wifi_disable();
        } else {
            wifi_enable();
        }
    }

    vTaskDelete(NULL);
}
*/

/**
 * Enable WIFI remote functionality
 */
/*
esp_err_t wifi_enable(void)
{
    if (wifi_enabled) {
        ESP_LOGW(TAG, "⚠️ WIFI is already enabled");
        return ESP_OK;
    }

    ESP_LOGI(TAG, "📡 Enabling WIFI remote...");

    // Take WIFI mutex
    if (xSemaphoreTake(wifi_mutex, pdMS_TO_TICKS(1000)) != pdTRUE) {
        ESP_LOGE(TAG, "❌ Failed to acquire WIFI mutex");
        return ESP_ERR_TIMEOUT;
    }

    esp_err_t ret = ESP_OK;

    // Initialize WIFI if not already done
    if (!wifi_connected) {
        // Configure web server
        web_server_config_t config = {
            .port = 80,
            .max_clients = 4,
            .enable_cors = true,
            .enable_auth = false,
            .ssid = "DroneCam-SLAM",
            .password = "dronecam123",
            .channel = 6,
            .max_connection = 4
        };

        ret = web_server_init(&config);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "❌ Web server initialization failed: %s", esp_err_to_name(ret));
            xSemaphoreGive(wifi_mutex);
            return ret;
        }

        // Start WIFI in AP mode
        ret = web_server_wifi_start();
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "❌ WIFI AP start failed: %s", esp_err_to_name(ret));
            xSemaphoreGive(wifi_mutex);
            return ret;
        }

        // Start web server
        ret = web_server_start();
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "❌ Web server start failed: %s", esp_err_to_name(ret));
            xSemaphoreGive(wifi_mutex);
            return ret;
        }

        wifi_connected = true;
        system_status.web_server_running = true;
        xEventGroupSetBits(system_event_group, WEB_SERVER_READY_BIT);
    }

    wifi_enabled = true;
    xSemaphoreGive(wifi_mutex);

    // Download AssistNow data if needed and configured
    if (master_config.gps.assistnow_enabled &&
        strlen(master_config.gps.assistnow_token) > 0 &&
        assistnow_is_download_needed()) {

        ESP_LOGI(TAG, "📡 WiFi available - checking for AssistNow data update...");
        esp_err_t assistnow_ret = assistnow_download_data();
        if (assistnow_ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ AssistNow data downloaded successfully");

            // Load the new data to GPS
            assistnow_upload_to_gps();
        } else {
            ESP_LOGW(TAG, "⚠️ AssistNow data download failed: %s", esp_err_to_name(assistnow_ret));
        }
    }

    ESP_LOGI(TAG, "🌐 Web interface: Connect to WiFi or use captive portal");
    ESP_LOGI(TAG, "📱 Access dashboard at: http://dronecam.local or device IP");

    return ESP_OK;
}
*/

/**
 * Disable WIFI remote functionality
 */
/*
esp_err_t wifi_disable(void)
{
    if (!wifi_enabled) {
        ESP_LOGW(TAG, "⚠️ WIFI is already disabled");
        return ESP_OK;
    }

    ESP_LOGI(TAG, "📡 Disabling WIFI remote...");

    // Take WIFI mutex
    if (xSemaphoreTake(wifi_mutex, pdMS_TO_TICKS(1000)) != pdTRUE) {
        ESP_LOGE(TAG, "❌ Failed to acquire WIFI mutex");
        return ESP_ERR_TIMEOUT;
    }

    esp_err_t ret = ESP_OK;

    // Stop web server and WIFI
    if (wifi_connected) {
        ret = web_server_stop();
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "⚠️ Web server stop warning: %s", esp_err_to_name(ret));
        }

        ret = web_server_wifi_stop();
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "⚠️ WIFI stop warning: %s", esp_err_to_name(ret));
        }

        wifi_connected = false;
        system_status.web_server_running = false;
        xEventGroupClearBits(system_event_group, WEB_SERVER_READY_BIT);
    }

    wifi_enabled = false;
    xSemaphoreGive(wifi_mutex);

    ESP_LOGI(TAG, "✅ WIFI remote disabled");

    return ESP_OK;
}
*/

/**
 * Initialize WiFi system using WiFi manager
 */
static esp_err_t initialize_wifi(void)
{
    ESP_LOGI(TAG, "📡 Initializing WiFi manager...");

    // Configure WiFi manager with default settings
    wifi_manager_config_t wifi_config = {
        .sta_ssid = "",  // Will be set later via comm_init_wifi_connection
        .sta_password = "",  // Will be set later via comm_init_wifi_connection
        .sta_connect_timeout_ms = 10000,
        .ap_ssid = "DroneCam-P4",
        .ap_password = "dronecam123",
        .ap_channel = 1,
        .ap_max_connections = 4,
        .auto_fallback = true,
        .scan_only_mode = false,
        .scan_interval_ms = 30000,
        .max_retry_count = 3
    };

    esp_err_t ret = wifi_manager_init(&wifi_config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "❌ Failed to initialize WiFi manager: %s", esp_err_to_name(ret));
        return ret;
    }

