Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
    ESP_LOGI(TAG, "✅ WiFi manager initialized successfully");
    return ESP_OK;
}

/**
 * Application main entry point
 */
void app_main(void)
{
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "=================================================");
    ESP_LOGI(TAG, "🚁 Visual SLAM Navigation Module for INAV");
    ESP_LOGI(TAG, "📡 ESP32-P4-WIFI6 with OV5647 MIPI-CSI Camera");
    ESP_LOGI(TAG, "🧠 Real-time ORB-SLAM with Web Interface");
    ESP_LOGI(TAG, "=================================================");
    ESP_LOGI(TAG, "");

    // Validate pin assignments at compile time
    VALIDATE_ALL_PIN_ASSIGNMENTS;

    ESP_LOGI(TAG, "✅ Pin configuration validated - no conflicts detected");

    // Initialize system components
    initialize_nvs();
    initialize_gpio();

    // WiFi will be initialized later after configuration is loaded

    // Create system synchronization objects
    system_mutex = xSemaphoreCreateMutex();
    system_event_group = xEventGroupCreate();
    
    if (system_mutex == NULL || system_event_group == NULL) {
        ESP_LOGE(TAG, "❌ Failed to create synchronization objects");
        return;
    }
    
    // Initialize TCP/IP stack (required for web server)
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    
    // Initialize hardware subsystems
    esp_err_t ret;
    
    // Initialize SD card storage FIRST (before components that need config)
    ESP_LOGI(TAG, "💾 Initializing SD card storage... (early init for config loading)");
    ret = map_manager_init();
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ SD card storage initialized successfully");

        // Initialize configuration loader
        ESP_LOGI(TAG, "⚙️ Initializing configuration loader... (early init for component config)");
        ret = config_loader_init();
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ Configuration loader initialized successfully");

            // Load master configuration BEFORE initializing components
            ESP_LOGI(TAG, "📖 Loading master configuration... (before component init)");
            ret = config_loader_load_all(&master_config);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ Master configuration loaded successfully");
                master_config.loaded = true;
            } else {
                ESP_LOGI(TAG, "ℹ️ No existing configuration found, creating defaults...");

                // Create default configuration files if they don't exist
                ESP_LOGI(TAG, "📝 Creating default configuration files...");
                ret = config_loader_create_defaults();
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "✅ Default configuration files created successfully");

                    // Now try to load the newly created defaults
                    ESP_LOGI(TAG, "📖 Loading newly created configuration...");
                    ret = config_loader_load_all(&master_config);
                    if (ret == ESP_OK) {
                        ESP_LOGI(TAG, "✅ Default configuration loaded successfully");
                        master_config.loaded = true;
                    } else {
                        ESP_LOGE(TAG, "❌ Failed to load default configuration: %s", esp_err_to_name(ret));
                        ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                    }
                } else {
                    ESP_LOGE(TAG, "❌ Failed to create default configuration files: %s", esp_err_to_name(ret));
                    ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                }
            }
        } else {
            ESP_LOGE(TAG, "❌ Configuration loader initialization failed: %s", esp_err_to_name(ret));
            ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
        }
    } else {
        ESP_LOGE(TAG, "❌ SD card storage initialization failed: %s", esp_err_to_name(ret));
        ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults (no SD card available)");
    }
    
    // Initialize communication with ESP32-C6 slave (web server)
    ESP_LOGI(TAG, "� Initializing communication with ESP32-C6 slave...");
    ret = comm_manager_init();
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ Communication manager initialized successfully");
        ESP_LOGI(TAG, "📡 ESP32-C6 will handle WiFi and web interface");
    } else {
        ESP_LOGE(TAG, "❌ Communication manager initialization failed: %s", esp_err_to_name(ret));
        ESP_LOGW(TAG, "⚠️ Continuing without C6 communication - SLAM system will still work");
    }
    
    // Initialize WiFi manager if enabled in configuration
    if (master_config.loaded && master_config.system.wifi_enabled) {
        ESP_LOGI(TAG, "🌐 WiFi enabled in configuration, initializing WiFi manager...");
        ret = initialize_wifi();
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ WiFi manager initialized successfully");
            
            // If we have WiFi credentials, try to connect
            if (strlen(master_config.system.wifi_ssid) > 0) {
                ESP_LOGI(TAG, "🌐 Starting WiFi connection to '%s'...", master_config.system.wifi_ssid);
                ret = comm_init_wifi_connection(master_config.system.wifi_ssid, 
                                              master_config.system.wifi_password);
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "✅ WiFi connection initiated successfully");
                } else {
                    ESP_LOGE(TAG, "❌ Failed to initiate WiFi connection: %s", esp_err_to_name(ret));
                }
            } else {
                ESP_LOGI(TAG, "⚠️ WiFi enabled but no SSID configured");
            }
        } else {
            ESP_LOGE(TAG, "❌ WiFi manager initialization failed: %s", esp_err_to_name(ret));
        }
    } else {
        ESP_LOGI(TAG, "🌐 WiFi disabled in configuration, skipping WiFi initialization");
    }
    
    // Now initialize components with loaded configuration
    ret = initialize_camera();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Camera initialization failed, continuing anyway...");
    }
    
    ret = initialize_gps();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "GPS initialization failed, continuing anyway...");
    }
    
    ret = initialize_msp();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "MSP initialization failed, continuing anyway...");
    }
    
    // Initialize IMU
    ret = sensor_fusion_register_imu(&master_config.imu.base_config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "IMU registration failed, continuing anyway...");
    }
    
    // List available maps (if SD card was initialized earlier)
    if (config_loader_is_sd_available()) {
        list_available_maps();

        // Try to load a default map if available
        ESP_LOGI(TAG, "🗺️ Checking for existing maps to load...");
        ret = load_slam_map(NULL);  // Load latest map
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ Existing map loaded successfully");
        } else {
            ESP_LOGI(TAG, "ℹ️ No existing map found, starting fresh");
        }
    }

            // First try to load existing configuration
            ESP_LOGI(TAG, "� Loading master configuration...");
            ret = config_loader_load_all(&master_config);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ Master configuration loaded successfully");
                master_config.loaded = true;
            } else {
                ESP_LOGI(TAG, "ℹ️ No existing configuration found, creating defaults...");
                
                // Create default configuration files if they don't exist
                ESP_LOGI(TAG, "� Creating default configuration files...");
                ret = config_loader_create_defaults();
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "✅ Default configuration files created successfully");
                    
