Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
                    // Now try to load the newly created defaults
                    ESP_LOGI(TAG, "📖 Loading newly created configuration...");
                    ret = config_loader_load_all(&master_config);
                    if (ret == ESP_OK) {
                        ESP_LOGI(TAG, "✅ Default configuration loaded successfully");
                        master_config.loaded = true;
                    } else {
                        ESP_LOGE(TAG, "❌ Failed to load default configuration: %s", esp_err_to_name(ret));
                        ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                    }
                } else {
                    ESP_LOGE(TAG, "❌ Failed to create default configuration files: %s", esp_err_to_name(ret));
                    ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                }
            }
    // Initialize SLAM system
    ret = initialize_slam();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "SLAM initialization failed, continuing anyway...");
    }

    // Initialize WiFi positioning system
    ESP_LOGI(TAG, "📍 Initializing WiFi positioning system...");
    wifi_positioning_config_t wifi_pos_config = {
        .scan_interval_ms = 30000,        // Scan every 30 seconds
        .min_ap_count = 3,                // Need at least 3 APs
        .max_ap_count = 10,               // Use up to 10 APs
        .min_rssi_threshold = -85,        // Minimum RSSI -85dBm
        .wigle_db_size = 10000,           // Support up to 10k entries
        .wigle_db_path = "/sdcard/wigle/wigle.db",
        .enable_auto_scan = true,         // Enable automatic scanning
        .position_timeout_ms = 5000       // 5 second timeout
    };

    ret = wifi_positioning_init(&wifi_pos_config);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ WiFi positioning initialized successfully");

        // Start WiFi positioning
        ret = wifi_positioning_start();
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ WiFi positioning started successfully");
        } else {
            ESP_LOGW(TAG, "⚠️ Failed to start WiFi positioning: %s", esp_err_to_name(ret));
        }
    } else {
        ESP_LOGW(TAG, "⚠️ WiFi positioning initialization failed: %s", esp_err_to_name(ret));
        ESP_LOGW(TAG, "ℹ️ Continuing without WiFi positioning - GPS/SLAM will still work");
    }

    // Save current configuration to SD card (if SD card is available)
    if (config_loader_is_sd_available()) {
        ESP_LOGI(TAG, "💾 Saving initial configuration to SD card...");
        save_configuration_to_sd();
    }

    // Create main processing tasks with optimized stack sizes
    xTaskCreatePinnedToCore(
        main_processing_task,
        "main_processing",
        12288,  // Increased stack for SLAM processing
        NULL,
        5,
        &main_processing_task_handle,
        1  // Pin to core 1
    );
    
    xTaskCreatePinnedToCore(
        web_interface_task,
        "web_interface",
        6144,   // Reduced stack since WiFi is disabled
        NULL,
        4,
        &web_interface_task_handle,
        0  // Pin to core 0
    );
    
    xTaskCreatePinnedToCore(
        telemetry_broadcast_task,
        "telemetry_broadcast",
        3072,   // Reduced stack since telemetry is minimal
        NULL,
        3,
        &telemetry_broadcast_task_handle,
        0  // Pin to core 0
    );
    
    // Create sensor monitoring task for GPS/IMU/MSP reconnection
    xTaskCreatePinnedToCore(
        sensor_monitoring_task,
        "sensor_monitor",
        5120,   // Increased for UART operations
        NULL,
        2,
        &sensor_monitoring_task_handle,
        0  // Pin to core 0
    );
    
    ESP_LOGI(TAG, "🚀 Visual SLAM Navigation Module started successfully!");
    ESP_LOGI(TAG, "🌐 Web interface: Connect to WiFi or use captive portal");
    ESP_LOGI(TAG, "📱 Access dashboard at: http://dronecam.local or device IP");
    
    // Main loop - monitor system health
    while (1) {
        // Check task health
        if (main_processing_task_handle != NULL && 
            eTaskGetState(main_processing_task_handle) == eDeleted) {
            ESP_LOGE(TAG, "❌ Main processing task died - stopping logging and restarting system");
            sd_storage_stop_comprehensive_logging();
            esp_restart();
        }
        
        if (web_interface_task_handle != NULL && 
            eTaskGetState(web_interface_task_handle) == eDeleted) {
            ESP_LOGE(TAG, "❌ Web interface task died - stopping logging and restarting system");
            sd_storage_stop_comprehensive_logging();
            esp_restart();
        }
        
        vTaskDelay(pdMS_TO_TICKS(5000)); // Check every 5 seconds
    }
    
    // Cleanup (should never reach here, but good practice)
    sd_storage_stop_comprehensive_logging();
}
